{
  "content": "Content",
  "about": "About",
  "education": "Education",
  "skills": "Skills",
  "experience": "Experience",
  "contact_me": "Contact me",


  "app_title": "Portfolios",

  "about_me": "About me",
  "my_name": "My name is {{candidateName}} ",
  "about_me_content": "I am a software engineer with experience building full-stack web applications. My primary languages include HTML, CSS, Java, Angular, Javascript, and React and I am quite passionate about Java, Angular, and React. I enjoy building full-stack web applications and working with different tools in the process of their creation. On one of my recent projects, the Restaurant Store Application, I worked with my team to build a responsive web application using Webstorm with Angular for the front-end, IntelliJ with Spring for the back-end, and DBeaver with Postgresql for persisting the data to our database. In my previous experience, I have worked as an IT technician, and Product Owner in Tokyo, Japan and it was while in this position that I found my passion for building websites and web applications. To pursue my passion, I moved to the United States, enrolled in college, and obtained my Master's Degree in Computer Information Systems. Working at Revature has allowed me to polish my skills and improve myself as an all-around professional. I have found that group synergy is the foundation for amazing projects and have discovered I am a great team player on all projects I worked on. In my spare time, you might find me spending time with my family and working in my garden.I am looking forward to my bright future in the Computer Science field and working with your team.",

  "education_page": "Education",
  "master_degree": "Master's Degree",
  "master_field": "Computer Information System",
  "master_school": "Boston University",
  "social_degree": "Computer Science",
  "social_field":"Social's Degree",
  "social_school": "Tokyo Computer community College",


  "skills_page": "Skills",
  "languages": "Languages",
  "DevOpps": "DevOpps",
  "skill_detail_java":"About 1 year of knowledge. Learning from community college, university and myself.",
  "skill_detail_postgresSql":"",
  "skill_detail_html":"",
  "skill_detail_css":"",
  "skill_detail_javascript":"",
  "skill_detail_typescript":"",
  "skill_detail_nodejs":"",
  "skill_detail_react":"",
  "skill_detail_angular":"",
  "skill_detail_spring":"",

  "skill_detail_git":"",
  "skill_detail_docker":"",




  "experience_page": "Experience",

  "contact_page": "Contact",
  "contact_info": "Contact Information",
  "full_name": "Full Name",
  "phone_number": "Phone Number",
  "email_me": "Contact me",
  "submit": "Submit",
  "name":"Name",
  "email": "E-Mail",
  "message":"Message"




}

