{
  "content": "Content",
  "about": "About",
  "education": "Education",
  "skills": "Skills",
  "experience": "Experience",
  "contact_me": "Contact me",


  "app_title": "Portfolios",

  "about_me": "About me",
  "my_name": "My name is {{candidateName}} ",
  "about_me_content": "I am a software engineer with experience in building full-stack web applications. My primary languages include ReactJs, HTML, CSS, Angular, Javascript, Spring Boot and Java and I am quite passionate about React, Java, and Angular. I enjoy building challenging applications where I can work on both the front end and back end while working with different tools. In one of my recent projects, a \"Restaurant Store Application\", I worked with my team to build a responsive web application using Angular for the front-end and Spring for the back-end. The database was persisted with Postgresql using Spring Data. In my previous experiences prior to coming to the USA, I have worked as an IT technician, and Product Owner in Tokyo, Japan. While it has been quite some time since I was in this position, I found my passion for building websites and web-enabled applications. To pursue my passion, I moved to the United States, enrolled in college, and obtained my Master's Degree in Computer Information Systems. Working at Revature has allowed me to polish my skills and improve myself as an all-around professional. I have found that group synergy is the foundation for amazing projects and my peers often commented that I am a great team player on all projects I worked on. In my spare time, you might find me spending time learning new ways to solve programming issues I hacked my way through to solve and deliver in a timely manners.I am looking forward to my bright future in the Computer Science field and working with your team.",

  "education_page": "Education",

  "master_degree": "Master's Degree",
  "master_field": "Computer Information System",
  "master_school": "Boston University",

  "social_degree_1": "Associate's Degree",
  "social_field_1": "Computer Science",
  "social_school_1": "Tokyo Computer community College",

  "social_degree_2": "Associate's Degree",
  "social_field_2":"Certification in Business marketing",
  "social_school_2": "Tokyo Business community College",

  "bachelor_degree": "Bachelor's Degree",
  "bachelor_field":"English and IT knowledge",
  "bachelor_school": "Information Technology and foreign language University",


  "skills_page": "Skills",
  "languages": "Languages",
  "DevOps": "DevOps",
  "skill_detail_Java":"Medium Proficiency. I have used this in several projects during my higher education and with my previous employments",
  "skill_detail_PostgresSql":"Light Experience. I have several projects that used postgresql while attending school and previous projects",
  "skill_detail_HTML":"Highly Proficient. It's one of the first things I learned while attending school.  When I freelance as a web developer, HTML is a necessity to deliver.  It is also equally important in learning new technologies as all web browsers still need HTML to render the document.",
  "skill_detail_CSS":"Highly Proficient. Learned it as part of my higher education.  I have been using this as a freelance web developer. I have also used SASS, COMPASS and LESS to quickly develop my project's CSS needs.",
  "skill_detail_JavaScript":"Highly Proficient. Javascript is one of the few languages modern web browsers understand and I have used it quite extensively.",
  "skill_detail_TypeScript":"Medium Proficiency. Writing in javascript is great.  But to truly write highly compatible javascript that many browsers can run, typescript has become my \"go to\" language",
  "skill_detail_NodeJs":"Light Proficiency.  I have only used this technology in my personal endeavors.",
  "skill_detail_React":"High Proficiency. This is my favorite technology and I have used this while preparing for onboarding with Revature's clients. Moreover this website has been created using ReactJS.",



  "skill_detail_Angular":"Medium Proficiency. While I have used it in my pursuit of higher education, I find that the technology not to be as inspiring as ReactJS",
  "skill_detail_SpringBoot":"Light Experience. I have used this technology while preparing for onboarding with Revature's clients.",

  "skill_detail_Git":"Medium Proficiency. Every project that is of importance has to be in a repository.",
  "skill_detail_Docker":"Light Usage.  This is one technology I am currently dabbling in. I am hoping to find an organization that can help more about it while using it in one of their projects.  I have only recently used it to locally host my database and web servers.",


  "contact_page": "Contact",
  "contact_info": "Contact Information",
  "full_name": "Full Name",
  "email_me": "Contact me",
  "submit": "Submit",
  "name":"Name",
  "email": "E-Mail",
  "message":"Message",
  "sent_success" : "Success",
  "sent_fail": "Fail",
  "success_message": "Thank you very much for your message.",
  "fail_message" : "Sending Form data was failed! Please try again.",

  "experience_page": "Experience",
  "year_1": "2022, Jan – 2022, June",
  "work_title_1": "Full Stack Developer • REVATURE CO., LMT • California",
  "work_detail_1_1": "• Trained and train myself to learn technologies relevant to client's need.",
  "work_detail_1_2": "• Created individual projects and team projects.",

  "year_2": "2012, July – 2014, June",
  "work_title_2": "IT Helpdesk • ROBERT WALTER CO., LMT • Tokyo",
  "work_detail_2_1": "• Manage IP phones and opening tickets for phone provider for new extensions.",
  "work_detail_2_2": "• Troubleshoot Software, Hardware and Networking issues.",
  "work_detail_2_3": "• Install and configure new PCs and Notebooks meant for employees.",
  "work_detail_2_4": "• Support remote users with VPN setup and communication tools like WebEx.",
  "work_detail_2_5": "• Provide technical support to other employees on use of software office suites.",

  "year_3": "2012, February – 2012, June",
  "work_title_3": "Jr. Programmer • FPT JAPAN CO., LTD • Tokyo",
  "work_detail_3_1": "• Developed new features for the application written in C++.",
  "work_detail_3_2": "• Created and executed Test Cases for the new features implemented.",

  "year_4": "2012, July – 2014, June",
  "work_title_4": "Product Owner • China Network CO., LTD • Tokyo",
  "work_detail_4_1": "• Continued engagement with client for NEC Soft Co., LTD",
  "work_detail_4_2": "• Responsible for interpretation of Japanese requirements to Vietnamese developers.",
  "work_detail_4_3": "• Helped onshore Vietnamese developers get acclimated to Japanese business culture during their engagement with the client.",
  "work_detail_4_4": "• Help plan releases for the application.",

  "year_5": "2007, November – 2010, March",
  "work_title_5": "Programmer, Product Owner • MDB CO., LTD • Tokyo",
  "work_detail_5_1": "• Initially worked with client engagements for NTTDATA Co., LTD from 2007 to 2008.",
  "work_detail_5_2": "• Added new features and provided bug fixes for the application for NTTDATA.",
  "work_detail_5_3": "• Create, document and execute test cases.",
  "work_detail_5_4": "• Engaged with new client NEC Soft Co., LTD as Product Owner (see responsibilities above)."

}

